Tekla Open API Reference for Tekla Structures 2025
Angle.FromDegrees Method
 Creates an angle from a value in degrees
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Angle FromDegrees(
	double degrees
)
Public Shared Function FromDegrees (
	degrees As Double
) As Angle
Parameters
degrees
Type: System.Double
The angle in degrees
Return Value
Type: Angle
An Angle object representing the given angle
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace